akiles/nrf5_sdk/examples/dfu/experimental_ant_bootloader/dfu_transport_ant.c
/*
This software is subject to the license described in the license.txt file included with this software distribution.You may not use this file except in compliance with this license.
Copyright © Dynastream Innovations Inc. 2014
All rights reserved.
*/

#include "dfu_transport.h"
#include "dfu.h"
#include "dfu_types.h"
#include "nrf51.h"
#include "nrf_sdm.h"
#include "nrf_gpio.h"
#include "nrf_delay.h"
#include "ant_error.h"
#include "ant_interface.h"
#include "ant_parameters.h"
#include "antfs.h"
#include "antfs_ota.h"
#include "ant_boot_settings.h"
#include "app_util.h"
#include "app_error.h"
#include "softdevice_handler.h"
#include "nordic_common.h"
#include "app_timer.h"
#include "hci_mem_pool.h"
#include "crc.h"
#include "pstorage.h"

#include "boards.h"
#include <stdio.h>
#include <string.h>

#include "debug_pin.h"
/*
 * ANTFS Configuration
 */
#define ANTFS_FILE_INDEX_UPDATE_APPLICATION         ((uint16_t)0xFB01)
#define ANTFS_FILE_INDEX_UPDATE_BOOTLOADER          ((uint16_t)0xFB02)
#define ANTFS_FILE_INDEX_UPDATE_STACK               ((uint16_t)0xFB03)
#define ANTFS_FILE_INDEX_UPDATE_STACK_BOOTLOADER    ((uint16_t)0xFB06)
#define ANTFS_FILE_INDEX_OTA_UPDATE_INFO            ((uint16_t)0x0001)

#define ANTFS_FILE_SIZE_MAX_DFU_IMAGE           ((uint32_t)DFU_IMAGE_MAX_SIZE_FULL)

#define ANTFS_UPLOAD_DATA_BUFFER_MIN_SIZE       128
#define ANTFS_UPLOAD_DATA_BUFFER_MAX_SIZE       160   // Maximum amount or it can cause trouble.

#define ANTFS_CLIENT_SERIAL_NUMBER              NRF_FICR->DEVICEID[0]                               /**< Serial number of client device. */

// The following parameters can be customized, and should match the OTA Updater tool Connection & Authentication settings
#define ANTFS_CLIENT_DEV_TYPE                   1u                                                 /**< Beacon device type . Set to Product ID*/
#define ANTFS_CLIENT_MANUF_ID                   255u                                               /**< Beacon manufacturer ID.  Set to your own Manufacturer ID (managed by ANT+) */
#define ANTFS_CLIENT_NAME                       { "ANTFS OTA Update" }                              /**< Client's friendly name.  This string  can be displayed to identify the device. */
#define ANTFS_CLIENT_PASSKEY                    {0x01, 0x02, 0x03, 0x04, 0x05, 0x06, 0x07, 0x08}    /**< Client authentication passkey. */

static const uint8_t m_friendly_name[]          = ANTFS_CLIENT_NAME;                                /**< Client's friendly name. */
static const uint8_t m_pass_key[]               = ANTFS_CLIENT_PASSKEY;                             /**< Authentication string (passkey). */

//static pstorage_handle_t                        m_storage_handle_ant;

static bool m_download_request_in_progress      = false;
static bool m_upload_request_in_progress        = false;
/*
 * Directory entry of OTA Update Information file.
 */
typedef struct
{
    antfs_dir_header_t header;                       /**< Directory header. */
    antfs_dir_struct_t directory_file[1]; /**< Array of directory entry structures. */
} directory_file_t;

// Directory
static const directory_file_t m_directory =
{
    {
        ANTFS_DIR_STRUCT_VERSION,                             // Version 1, length of each subsequent entry = 16 bytes, system time not used.
        sizeof(antfs_dir_struct_t),
        0, 0, 0, 0, 0, 0, 0, 0
    },
    {
        {
            ANTFS_FILE_INDEX_OTA_UPDATE_INFO,       /* Index*/
            OTA_UPDATE_INFO_FILE_DATA_TYPE,         /* File Data Type*/
            1,                                      /* File Sub Type*/
            0,                                      /* File Number*/
            0,                                      /* File Data Type Specific Flags*/
            0x80,                                   /* Read only, General File Flags*/
            OTA_UPDATE_INFO_FILE_SIZE,              /* File Size*/
            0xFFFFFFFF
        },
    },
};


static antfs_event_return_t     m_antfs_event;                  /**< ANTFS event queue element. */
static antfs_request_info_t     m_response_info;                /**< Parameters for response to a download and upload request. */
static uint32_t                 m_current_file_size;            /**< File Size. */
static uint32_t                 m_current_offset;               /**< ANTFS current valid and processed offset, used to do upload retries. */
static uint16_t                 m_current_crc;                  /**< ANTFS current valid and processed offset, used to do upload retries. */
static uint16_t                 m_current_file_index;           /**< ANTFS current File Index. */

static uint32_t                 m_pending_offset;
static uint16_t                 m_pending_crc;

static uint8_t                  * mp_rx_buffer;

static bool                     m_image_data_complete;
static uint32_t                 m_image_data_count;
static uint32_t                 m_image_data_offset;
static uint32_t                 m_image_data_max;
static uint16_t                 m_image_data_crc_post;
static uint16_t                 m_image_data_crc_pre;

static uint16_t                 m_validation_crc;
static uint16_t                 m_ota_file_crc;

static dfu_update_mode_t        m_update_mode = DFU_UPDATE_NONE;

static dfu_update_packet_t      dfu_pkt;

typedef struct{
    uint8_t         a_mem_pool[ANTFS_UPLOAD_DATA_BUFFER_MAX_SIZE];
    uint32_t        size;
    uint16_t        crc;
    uint8_t         priority;
} mem_pool_t;
mem_pool_t m_mem_pool_1;
mem_pool_t m_mem_pool_2;
static mem_pool_t * mp_buffering_handle;

typedef enum{
    ANTFS_DFU_STATE_RESET,              // State after reset, uninitialized
    ANTFS_DFU_STATE_INIT_DELAYED,
    ANTFS_DFU_STATE_READY,              //
    ANTFS_DFU_STATE_VALIDATED,          // Images successfully validated
    ANTFS_DFU_STATE_COMPLETED,          // Activation is done and ready for the reset.
    ANTFS_DFU_STATE_FLASH_ERASE,        // Long flash erase activity.
    ANTFS_DFU_STATE_FLASH_PENDING,      // Detected pending writes.
    ANTFS_DFU_STATE_STALL,
}antfs_dfu_state_t;
static antfs_dfu_state_t        m_antfs_dfu_state;

static uint16_t                 m_data_buffered;         /**< Accumulated data to be written to flash */
static bool                     m_ota_image_header_parsed       = false;
static bool                     m_upload_swap_space_prepared    = false;

