akiles/nrf5_sdk/examples/dfu/experimental_ant_bootloader/dfu_transport_ant.c
static void services_init(void);
static bool flash_busy(void);

//static pstorage_handle_t m_storage_handle_ant = {0};
//static void boot_return_set (uint32_t status)
//{
//    uint32_t return_value = *ANT_BOOT_PARAM_RETURN;
//
//    return_value &= ~PARAM_RETURN_BOOT_STATUS_Msk;
//    return_value |= status & PARAM_RETURN_BOOT_STATUS_Msk;
//
//    if (m_storage_handle_ant.module_id != PSTORAGE_MAX_APPLICATIONS + 1)
//    {
//        m_storage_handle_ant.module_id  = PSTORAGE_MAX_APPLICATIONS + 1; //Steal the raw mode module ID.
//        m_storage_handle_ant.block_id   = ANT_BOOT_PARAM_RETURN_BASE;
//    }
//    pstorage_raw_store(&m_storage_handle_ant, (uint8_t*)&return_value, sizeof(uint32_t), 0);
//}

/**@brief     Function for notifying a DFU Controller about error conditions in the DFU module.
 *            This function also ensures that an error is translated from nrf_errors to DFU Response
 *            Value.
 *
 * @param[in] p_dfu DFU Service Structure.
 * @param[in] err_code  Nrf error code that should be translated and send to the DFU Controller.
 */
static void dfu_error_notify(uint32_t err_code, uint32_t err_point)
{
   // Unexpected error occured,
#if defined (DBG_DFU_UART_OUT_PIN)
    //Wait until all the uart successfully sent out.
    nrf_delay_us(50);

    DEBUG_UART_OUT(0xEE);
    DEBUG_UART_OUT(err_point);

    nrf_delay_us(50);

#endif
    // TODO: we need to come up of something to handle this
    NVIC_SystemReset();
}

/**@brief       Function for handling the callback events from the dfu module.
 *              Callbacks are expected when \ref dfu_data_pkt_handle has been executed.
 *
 * @param[in]   result  Operation result code. NRF_SUCCESS when a queued operation was successful.
 * @param[in]   p_data  Pointer to the data to which the operation is related.
 */
/*
 * NOTE: This callback is only called by the following
 *  - Storing done operation by dfu_data_pkt_handle
 *  - And all clearing done operation.
 */
static void dfu_cb_handler(uint32_t result, uint8_t * p_data)
{
    uint32_t err_code;
    uint16_t rxd_buffer_len = 0;
    uint16_t preflashed_crc = 0;

#if defined (DBG_DFU_UART_OUT_PIN)
    DEBUG_UART_OUT(0xFF);
    DEBUG_UART_OUT(m_antfs_dfu_state);
#endif

    switch (m_antfs_dfu_state)
    {
        case ANTFS_DFU_STATE_INIT_DELAYED:
            // This is when upon initialization, a pre-erase operation have occured i.e. bank1 pre clearing.
            services_init();
            break;

        case ANTFS_DFU_STATE_FLASH_ERASE:
            // Handles upload and download request response delay when there is ongoing flash activities
            // Generally we need to avoid flash activities and burst activities to happen at the same time.
            // ANTFS request response are delayed and when flash is done response are handled here.
            if (m_upload_request_in_progress)
            {
                m_upload_request_in_progress    = false;
                // Make sure we got all the latest values.
                m_response_info.file_size.data  = m_current_offset;
                m_response_info.file_crc        = m_current_crc;
                if (result == NRF_SUCCESS)
                {
                    m_upload_swap_space_prepared = true;
                    UNUSED_VARIABLE(antfs_upload_req_resp_transmit(RESPONSE_MESSAGE_OK, &m_response_info));
                }
                else
                {
                    /* Not ready */
                    UNUSED_VARIABLE(antfs_upload_req_resp_transmit(RESPONSE_MESSAGE_UPLOAD_NOT_READY, &m_response_info));
                }
            }

            if (m_download_request_in_progress)
            {
                m_download_request_in_progress = false;

                UNUSED_VARIABLE(antfs_download_req_resp_prepare(RESPONSE_MESSAGE_OK, &m_response_info));
            }

            m_antfs_dfu_state = ANTFS_DFU_STATE_READY;
            break;


        case ANTFS_DFU_STATE_FLASH_PENDING:
        case ANTFS_DFU_STATE_READY:
            // Handles Flash write call back queued by Upload Data.
            if (result != NRF_SUCCESS)
            {
                UNUSED_VARIABLE(antfs_upload_data_resp_transmit(false));
                m_antfs_dfu_state = ANTFS_DFU_STATE_STALL;
                return;
            }

            if ((m_mem_pool_1.size != 0) && (m_mem_pool_2.priority == 0))
            {
                rxd_buffer_len = m_mem_pool_1.size;
                preflashed_crc = m_mem_pool_1.crc;
                m_mem_pool_1.size = 0;
            }
            else if (m_mem_pool_2.size != 0)
            {
                rxd_buffer_len = m_mem_pool_2.size;
                preflashed_crc = m_mem_pool_2.crc;
                m_mem_pool_2.size = 0;
                m_mem_pool_2.priority = 0;
            }
            else
            {
                UNUSED_VARIABLE(antfs_upload_data_resp_transmit(false));
                m_antfs_dfu_state = ANTFS_DFU_STATE_STALL;
                return;
            }

            // Verify the data written to flash.
            m_image_data_crc_post = crc_crc16_update(m_image_data_crc_post, (uint8_t*)(dfu_storage_start_address_get() + m_image_data_offset), rxd_buffer_len);
            if (m_image_data_crc_post != preflashed_crc)
            {
                UNUSED_VARIABLE(antfs_upload_data_resp_transmit(false));
                m_antfs_dfu_state = ANTFS_DFU_STATE_STALL;
                return;
            }
            m_image_data_offset += rxd_buffer_len;

            //update current offsets and crc
            m_current_offset    = m_pending_offset;
            m_current_crc       = m_pending_crc;

            if (m_antfs_dfu_state == ANTFS_DFU_STATE_FLASH_PENDING)
            {
                m_antfs_dfu_state = ANTFS_DFU_STATE_READY;
                // Update it with the latest values;
                m_response_info.file_size.data            = m_current_offset;
                m_response_info.file_crc                  = m_current_crc;
                if (m_upload_request_in_progress)
                {
                    UNUSED_VARIABLE(antfs_upload_req_resp_transmit(RESPONSE_MESSAGE_OK, &m_response_info));
                }
                else if (m_image_data_complete == false)
                {
                    UNUSED_VARIABLE(antfs_upload_data_resp_transmit(true));
                }
            }

            // We got all the image validate it right away.
            if ((m_image_data_complete == true) && ( m_image_data_max == m_image_data_offset))
            {
                err_code = dfu_image_validate(m_validation_crc, m_ota_file_crc);
                if (err_code == NRF_SUCCESS)
                {
                    m_antfs_dfu_state = ANTFS_DFU_STATE_VALIDATED;
                    UNUSED_VARIABLE(antfs_upload_data_resp_transmit(true));
                }
                else
                {
//                    boot_return_set(PARAM_RETURN_BOOT_STATUS_Failed);
                    m_antfs_dfu_state = ANTFS_DFU_STATE_STALL;
                    UNUSED_VARIABLE(antfs_upload_data_resp_transmit(false));
                }
            }
            break;

        default:
            break;
    }
}

/**@brief Function for processing ANTFS upload request data event.
 *
 * @param[in] p_event The event extracted from the queue to be processed.
 */
static void antfs_event_upload_request_handle(const antfs_event_return_t * p_event)
{
    uint32_t    err_code = RESPONSE_MESSAGE_OK;
    uint8_t     new_request = false;

    if (m_antfs_dfu_state == ANTFS_DFU_STATE_FLASH_ERASE)
    {
        return;
    }

    /*reset*/
    m_response_info.file_index.data           = p_event->file_index;
    m_response_info.max_burst_block_size.data = 0;
    m_response_info.max_file_size             = 0;
    m_response_info.file_size.data            = 0;
    m_response_info.file_crc                  = 0;

