akiles/nrf5_sdk/examples/dfu/experimental_ant_bootloader/dfu_transport_ant.c
                // A flash erase is expected at this time. postpone response if there is.
                if (flash_busy())
                {
                    m_upload_request_in_progress = true;
                    m_antfs_dfu_state = ANTFS_DFU_STATE_FLASH_ERASE;
                    return;
                }
            }
            else
            {
                // Check if there are still pending writes scheduled in Flash.
                if (flash_busy())
                {
                    m_upload_request_in_progress = true;
                    m_antfs_dfu_state = ANTFS_DFU_STATE_FLASH_PENDING;
                    return;
                }
            }

            m_antfs_dfu_state = ANTFS_DFU_STATE_READY;
            UNUSED_VARIABLE(antfs_upload_req_resp_transmit(RESPONSE_MESSAGE_OK, &m_response_info));
        }
            break;
        default:
            m_antfs_dfu_state = ANTFS_DFU_STATE_READY;
            UNUSED_VARIABLE(antfs_upload_req_resp_transmit(RESPONSE_MESSAGE_NOT_EXIST, &m_response_info));
    }
}


static void antfs_event_upload_start_handle(const antfs_event_return_t * p_event)
{
    switch (m_current_file_index)
    {
        case ANTFS_FILE_INDEX_UPDATE_STACK:
        case ANTFS_FILE_INDEX_UPDATE_BOOTLOADER:
        case ANTFS_FILE_INDEX_UPDATE_APPLICATION:
        case ANTFS_FILE_INDEX_UPDATE_STACK_BOOTLOADER:
            break;
    }

    // reset buffered data
    m_data_buffered = 0;
}


/**@brief Function for processing ANTFS upload data event.
 *
 * @param[in] p_event The event extracted from the queue to be processed.
 */
static void antfs_event_upload_data_handle(const antfs_event_return_t * p_event)
{
    uint32_t    image_data_count_remaining;
    uint8_t *   p_rxd_data;
    uint32_t    rxd_data_size;
    uint32_t    err_code                    = NRF_SUCCESS;
    bool        callback_activated          = false;
    ota_image_header_t * p_ota_image_header;

     // Allocate a memory pool for upload buffering.
    if (m_data_buffered == 0)
    {
        // Check which pool is empty.
        if (m_mem_pool_1.size == 0)
        {
            mp_buffering_handle = &m_mem_pool_1;
        }
        else if (m_mem_pool_2.size == 0)
        {
            mp_buffering_handle = &m_mem_pool_2;
        }
        else
        {
            // something is wrong.
            dfu_error_notify(err_code, 6);
        }
        mp_rx_buffer = &mp_buffering_handle->a_mem_pool[0];
    }

    if ((p_event->bytes + m_data_buffered) < ANTFS_UPLOAD_DATA_BUFFER_MAX_SIZE)
    {
        // Copy over the buffer the rx'd 8 byte data
        memcpy(mp_rx_buffer + m_data_buffered, p_event->data, p_event->bytes);
        // Advance buffered count
        m_data_buffered += p_event->bytes;
        // Advance current over all data count.
    }
    else
    {
        // something is wrong.
        dfu_error_notify(err_code, 7);
    }

    if ((m_data_buffered >= ANTFS_UPLOAD_DATA_BUFFER_MIN_SIZE) ||
            ((m_pending_offset + m_data_buffered) >= m_current_file_size))
    {
       /* If any of the pool is still pending process and we are running out of space
        * The ANTFS_UPLOAD_DATA_BUFFER_MIN_SIZE should be enough delay to get the previous buffer be processed, including flashing*/
        if (((m_mem_pool_1.size != 0) || (m_mem_pool_2.size != 0)) && ((m_pending_offset + m_data_buffered) < m_current_file_size))
        {
            if (m_data_buffered < ANTFS_UPLOAD_DATA_BUFFER_MAX_SIZE)
            {   // We can wait for a bit.
                return;
            }
            else
            {
                // Something is wrong. the device is not flashing.
                UNUSED_VARIABLE(antfs_upload_data_resp_transmit(false));
                m_antfs_dfu_state = ANTFS_DFU_STATE_STALL;
                return;
            }
        }

        mp_buffering_handle->size   = m_data_buffered;          // Set the size and consider this pool closed and ready for processing.
        m_data_buffered             = 0;                        // Reset buffered data count

        // Decide what to do with the data in the buffer.
        switch (m_current_file_index)
        {
            case ANTFS_FILE_INDEX_UPDATE_STACK:
            case ANTFS_FILE_INDEX_UPDATE_BOOTLOADER:
            case ANTFS_FILE_INDEX_UPDATE_APPLICATION:
            case ANTFS_FILE_INDEX_UPDATE_STACK_BOOTLOADER:

                // Not in the right state
                if (m_antfs_dfu_state != ANTFS_DFU_STATE_READY)
                {
                    // Throw it away.
                    mp_buffering_handle->size   = 0;
                    mp_buffering_handle         = NULL;
                    UNUSED_VARIABLE(antfs_upload_data_resp_transmit(false));
                    m_antfs_dfu_state = ANTFS_DFU_STATE_STALL;
                    return;
                }

                p_rxd_data      = mp_buffering_handle->a_mem_pool;
                rxd_data_size   = mp_buffering_handle->size;

                // pre calculate pending offset and crc
                m_pending_offset  = m_current_offset + rxd_data_size;
                m_pending_crc     = crc_crc16_update(m_current_crc, p_rxd_data, rxd_data_size);

                /***********
                 * Header Section
                 */
                if (!m_ota_image_header_parsed)
                {
                    // Parse the Header
                    p_ota_image_header = antfs_ota_image_header_parsing(p_rxd_data, rxd_data_size);
                    if (p_ota_image_header == NULL)
                    {
                        // Invalid header, fail now.
                        UNUSED_VARIABLE(antfs_upload_data_resp_transmit(false));
                        return;
                        //dfu_error_notify(err_code, 13);
                    }
                    m_ota_image_header_parsed = true;

                    // Fill in DFU parameters
                    dfu_pkt.params.start_packet.dfu_update_mode    = m_update_mode;
                    dfu_pkt.params.start_packet.sd_image_size      = p_ota_image_header->wireless_stack_size;
                    dfu_pkt.params.start_packet.bl_image_size      = p_ota_image_header->bootloader_size;
                    dfu_pkt.params.start_packet.app_image_size     = p_ota_image_header->application_size;

                    err_code = dfu_start_pkt_handle(&dfu_pkt);        // reinitializing dfu pkt
                    if (err_code)
                    {
                        UNUSED_VARIABLE(antfs_upload_data_resp_transmit(false));
                        m_antfs_dfu_state = ANTFS_DFU_STATE_STALL;
                        return;
                    }

