akiles/nrf5_sdk/examples/dfu/experimental_ant_bootloader/dfu_transport_ant.c
                    //precalculating validation crc up to the header size only.
                    m_validation_crc = crc_crc16_update(0, p_rxd_data, p_ota_image_header->header_size);

                    // Adjust handler parameters.
                    p_rxd_data          += p_ota_image_header->header_size;
                    rxd_data_size       -= p_ota_image_header->header_size;

                    m_image_data_max    =  p_ota_image_header->wireless_stack_size
                                         +  p_ota_image_header->bootloader_size
                                         +  p_ota_image_header->application_size;

                }

                /***********
                 * Image Section
                 */
                if (!m_image_data_complete)
                {
                    m_upload_swap_space_prepared = false;

                    // Check if it is way over the image section
                    if ((m_image_data_count +  rxd_data_size) >= m_image_data_max)
                    {
                        image_data_count_remaining                  = m_image_data_max - m_image_data_count;

                        dfu_pkt.params.data_packet.p_data_packet    = (uint32_t*) p_rxd_data;
                        dfu_pkt.params.data_packet.packet_length    = image_data_count_remaining  / sizeof(uint32_t);

                        // store flushed information for flash write verification.
                        mp_buffering_handle->size                   = image_data_count_remaining;
                        m_image_data_crc_pre                        = crc_crc16_update(m_image_data_crc_pre, p_rxd_data, image_data_count_remaining);
                        mp_buffering_handle->crc                    = m_image_data_crc_pre;

                        //Adjust data count and size for parsing the remaining data in the info section.
                        p_rxd_data                                  += image_data_count_remaining;
                        rxd_data_size                               -= image_data_count_remaining;
                    }
                    else
                    {
                        dfu_pkt.params.data_packet.p_data_packet    = (uint32_t*) p_rxd_data;
                        dfu_pkt.params.data_packet.packet_length    = rxd_data_size / sizeof(uint32_t);

                        // store flushed information for flash write verification.
                        mp_buffering_handle->size                   = rxd_data_size;
                        m_image_data_crc_pre                        = crc_crc16_update(m_image_data_crc_pre, p_rxd_data, rxd_data_size);
                        mp_buffering_handle->crc                    = m_image_data_crc_pre;
                    }

                    // Pass the image to dfu.
                    dfu_pkt.packet_type        = DATA_PACKET;
                    err_code = dfu_data_pkt_handle(&dfu_pkt);
                    if (err_code == NRF_SUCCESS)
                    {
                        // All the expected firmware image has been received and processed successfully.
                        m_image_data_complete = true;
                    }
                    else if (err_code == NRF_ERROR_INVALID_LENGTH)
                    {
                        // The image is still partially completed. We need more.
                        //do nothing;
                    }
                    // Unmanaged return code. Something is wrong need to abort.
                    else
                    {
                        //TODO Need to figure out what to do on unmanaged returns. Maybe reset
                        dfu_error_notify(err_code, 9);
                    }

                    m_image_data_count += mp_buffering_handle->size;

                    callback_activated = true;

                    if ((mp_buffering_handle == &m_mem_pool_1) && (m_mem_pool_2.size != 0))
                    {
                        m_mem_pool_2.priority = 1;
                    }
                }

                /***********
                 * Info section
                 */
                if (m_image_data_complete)
                {
                    // -Version info
                    // -CRC
                    if(antfs_ota_version_info_parsing(&p_rxd_data, &rxd_data_size))
                    {
                        // do nothing for now.
                    }

                    if (antfs_ota_crc_parsing(&p_rxd_data, &rxd_data_size))
                    {
                        m_ota_file_crc = antfs_ota_crc_get();
                    }

                    // Covering cases when we dont expect a callback to free up mem_pool.
                    if (!callback_activated)
                    {
                        mp_buffering_handle->size       = 0;
                        mp_buffering_handle->priority   = 0;
                        mp_buffering_handle             = NULL;
                    }
                }
                m_antfs_dfu_state = ANTFS_DFU_STATE_READY;

                break;

            default:
                mp_buffering_handle->size = 0;
                break;
        }
    }
}


static void antfs_event_upload_complete_handle(const antfs_event_return_t * p_event)
{
    if (m_antfs_dfu_state == ANTFS_DFU_STATE_VALIDATED)
    {
       // only send this response if we have validated the upload
       UNUSED_VARIABLE(antfs_upload_data_resp_transmit(true));
    }
    else if (m_antfs_dfu_state == ANTFS_DFU_STATE_READY)
    {
        if (flash_busy())
        {
            m_antfs_dfu_state = ANTFS_DFU_STATE_FLASH_PENDING;
            return;
        }
        else
        {
            UNUSED_VARIABLE(antfs_upload_data_resp_transmit(true));
        }
    }
    else
    {
        // no implementation
    }
}


static void antfs_event_upload_fail_handle(const antfs_event_return_t * p_event)
{
    if (m_antfs_dfu_state == ANTFS_DFU_STATE_READY)
    {
        UNUSED_VARIABLE(antfs_upload_data_resp_transmit(false));
    }
}


/**@brief Function for processing ANTFS download request event.
 *
 * @param[in] p_event The event extracted from the queue to be processed.
 */
static void antfs_event_download_request_handle(const antfs_event_return_t * p_event)
{
    uint8_t response = RESPONSE_MESSAGE_OK;

